app/Controllers/C_laporan.php

SELECT *, `penyewaan`.`id` as `id_penyewaan`
FROM `pembayaran`
LEFT JOIN `penyewaan` ON `penyewaan`.`id`=`pembayaran`.`id_penyewaan`
WHERE `penyewaan`.`tanggal` >= '2022-09-29'
AND `penyewaan`.`tanggal` <= '2022-09-29'
ORDER BY `penyewaan`.`tanggal` DESC
---
    public function laporan_penyewaan()
    {
        $db   = \Config\Database::connect();
        $data['judul_halaman'] = 'Laporan Penyewaan Perlengkapan Pesta';
        $tanggal_awal = $this->request->getPost('tgl_awal');
        $tanggal_akhir = $this->request->getPost('tgl_akhir');
        $data['tgl_awal'] = $tanggal_awal;
        $data['tgl_akhir'] = $tanggal_akhir;
        $data['data'] = $db->table('pembayaran')->select('*,penyewaan.id as id_penyewaan')
            ->join('penyewaan', 'penyewaan.id=pembayaran.id_penyewaan', 'left')
            ->where('penyewaan.tanggal >=', $tanggal_awal)
            ->where('penyewaan.tanggal <=', $tanggal_akhir)
            ->orderBy('penyewaan.tanggal', 'desc')
            ->get()->getResult();