app/Controllers/C_pengembalian.php

SELECT *, `penyewaan`.`id` as `id_penyewaan`
FROM `penyewaan`
JOIN `penyewa` ON `penyewa`.`id`=`penyewaan`.`id_penyewa`
WHERE `penyewaan`.`status_sewa` = 1
---
    public function index()
    {
        $db   = \Config\Database::connect();
        $data['judul_halaman'] = 'Data Pengembalian Perlengkapan Pesta';
        $data['data'] = $db->table('penyewaan')->select('*,penyewaan.id as id_penyewaan')
            ->join('penyewa', 'penyewa.id=penyewaan.id_penyewa')
            ->where('penyewaan.status_sewa', 1)
            ->get()->getResult();

SELECT *, `penyewaan`.`id` as `id_penyewaan`
FROM `penyewaan`
JOIN `penyewa` ON `penyewa`.`id`=`penyewaan`.`id_penyewa`
WHERE `penyewaan`.`id` = '1'
SELECT *
FROM `detail_penyewaan`
WHERE `id_penyewaan` = '1'
---
    public function detail_sewa($id = "")
    {
        $db   = \Config\Database::connect();
        $data['judul_halaman'] = 'Detail Penyewaan Perlengkapan Pesta';
        $data['data_penyewaan'] = $db->table('penyewaan')->select('*,penyewaan.id as id_penyewaan')
            ->join('penyewa', 'penyewa.id=penyewaan.id_penyewa')
            ->where('penyewaan.id', $id)->get()->getRow();
        $data['detail_penyewaan'] = $db->table('detail_penyewaan')->getWhere(['id_penyewaan' => $id])->getResult();