app/Views/laporan/V_laporan_penyewaan.php

SELECT *
FROM `penyewa`
WHERE `id` = '1'
SELECT *
FROM `detail_penyewaan`
WHERE `id_penyewaan` = '1'
---
                                    $total = $total + $d->total_pembayaran_sewa;
                                    // $total = $total + $sudah_dibayar;
                                    $db   = \Config\Database::connect();
                                    $penyewa = $db->table('penyewa')->getWhere(['id' => $d->id_penyewa])->getRow();

                                    $detail = $db->table('detail_penyewaan')->getWhere(['id_penyewaan' => $d->id])->getResult();